posts/modularizing-python/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="Making python more OOP Friendly">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Modularizing Python | Hayden's Tinkering Blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://hsszyman.github.io/posts/modularizing-python/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Hayden Szymanski">
<link rel="prev" href="../dwm/" title="Hacking DWM : Holdbar" type="text/html">
<meta property="og:site_name" content="Hayden's Tinkering Blog">
<meta property="og:title" content="Modularizing Python">
<meta property="og:url" content="https://hsszyman.github.io/posts/modularizing-python/">
<meta property="og:description" content="Making python more OOP Friendly">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2019-06-29T18:42:12-04:00">
<meta property="article:tag" content="bash">
<meta property="article:tag" content="linux">
<meta property="article:tag" content="python">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="https://hsszyman.github.io/">

            <span id="blog-title">Hayden's Tinkering Blog</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Modularizing Python</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Hayden Szymanski
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2019-06-29T18:42:12-04:00" itemprop="datePublished" title="2019-06-29 18:42">2019-06-29 18:42</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
Python is a fairly nifty language that is extremely approacheable and easy to use, especially in a unix environment. There are a few drawbacks for writing scripts with python and preparing it for deployment to be used as a commandline tool.
</p>

<div id="outline-container-org8b21afd" class="outline-2">
<h2 id="org8b21afd">Issue 1: Main Function not receiving declerations from later functions</h2>
<div class="outline-text-2" id="text-org8b21afd">
<p>
The first Issue I ran into was order of execution issues when using a main function. I'm a lot more used to and comfortable with having a main function, and while this can be done with python, you'll need to add a bit of code so that the main function is away of declerations called after it in the same file.
</p>

<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">__future__</span> <span class="kn">import</span> <span class="n">print_function</span>

<span class="k">def</span> <span class="nf">main_func</span><span class="p">():</span>
    <span class="k">print</span><span class="p">(</span><span class="s2">"Hello World"</span><span class="p">)</span>

<span class="k">if</span> <span class="n">__name</span> <span class="o">==</span> <span class="s2">"__main__"</span><span class="p">:</span>
    <span class="n">main_func</span><span class="p">()</span>
</pre></div>

<p>
This will run your main function after all other functions have been called ( barring you put the actual function execution at the end of the file ) 
</p>
</div>
</div>

<div id="outline-container-orgb37e3f0" class="outline-2">
<h2 id="orgb37e3f0">Issue 2 : Portable python code that can be executed</h2>
<div class="outline-text-2" id="text-orgb37e3f0">
<p>
Another Issue ( and slightly harder for me to fix ) was creating a single, runnable file that I can execute python code from, without having to worry about linkages to external files. Luckily, in python this is completely doable if you make use of pythons ability to run python code from within a zip file if you have a file within it called <span class="underline"><span class="underline">main</span></span>.py. If I create a project structure and zip it, I can still execute everything ( barring imports are relative pathed ) from calling that zip file! This let's us have multi-file python projects that can potentially be executed in a manner similar to an executable, with all the dependencies included.
</p>
</div>
</div>

<div id="outline-container-org65d3577" class="outline-2">
<h2 id="org65d3577">A comprehensive solution to our problems</h2>
<div class="outline-text-2" id="text-org65d3577">
<p>
I took the liberty of writing up a fairly complete bash script that automates this entire process for you. It takes in a argument representing the project name. In addition it does several other things:
</p>

<ol class="org-ol">
<li>Generates a main file with a similar python template to the one I showed earlier.</li>
<li>Bundles all the python files in your current directory into a new zip file</li>
<li>Renames whatever the main file is in your program to <span class="underline"><span class="underline">main</span></span>.py</li>
</ol>
<div class="highlight"><pre><span></span><span class="ch">#!/bin/bash</span>

<span class="k">if</span> <span class="o">[</span> <span class="nv">$#</span> -eq <span class="m">0</span> <span class="o">]</span> 
<span class="k">then</span>
	<span class="nb">exit</span> <span class="m">1</span>
<span class="k">else</span>
	<span class="nv">name</span><span class="o">=</span><span class="nv">$1</span>
<span class="k">fi</span>
<span class="k">if</span> <span class="o">[</span> <span class="nv">$#</span> -eq <span class="m">2</span> <span class="o">]</span> <span class="o">&amp;&amp;</span> <span class="o">[</span> <span class="s2">"</span><span class="nv">$2</span><span class="s2">"</span> <span class="o">==</span> <span class="s2">"init"</span> <span class="o">]</span>
<span class="k">then</span>
    <span class="nb">echo</span> <span class="s2">"from __future__ import print_function"</span> &gt;&gt; <span class="nv">$1</span>.py
    <span class="nb">echo</span> &gt;&gt; <span class="nv">$1</span>.py
    <span class="nb">echo</span> <span class="s2">"def main_func():"</span> &gt;&gt; <span class="nv">$1</span>.py
    <span class="nb">echo</span>    <span class="s2">"    print(\"stub\")"</span> &gt;&gt; <span class="nv">$1</span>.py
    <span class="nb">echo</span> &gt;&gt; <span class="nv">$1</span>.py
    <span class="nb">echo</span> <span class="s2">"if __name__ == \"__main__\":"</span> &gt;&gt; <span class="nv">$1</span>.py
    <span class="nb">echo</span> <span class="s2">"    main_func()"</span> &gt;&gt; <span class="nv">$1</span>.py
<span class="k">fi</span>
<span class="nv">main_file</span><span class="o">=</span><span class="s2">"</span><span class="nv">$name</span><span class="s2">.py"</span>


mkdir <span class="s2">"</span><span class="nv">$name</span><span class="s2">"</span>
cp -r <span class="nv">$main_file</span> ./<span class="s2">"</span><span class="nv">$name</span><span class="s2">"</span>/__main__.py <span class="m">2</span>&gt; /dev/null
cp -r <span class="k">$(</span>ls *.py <span class="p">|</span> grep -v <span class="nv">$main_file</span><span class="k">)</span> ./<span class="s2">"</span><span class="nv">$name</span><span class="s2">"</span>/ <span class="m">2</span>&gt; /dev/null
<span class="nb">cd</span> ./<span class="nv">$name</span>
zip ../<span class="nv">$name</span> <span class="k">$(</span>ls *.py<span class="k">)</span>
<span class="nb">cd</span> ..

<span class="k">if</span> <span class="o">[</span> ! -d <span class="s2">"output"</span> <span class="o">]</span>
<span class="k">then</span>
	mkdir output
<span class="k">fi</span>

mv <span class="nv">$name</span>.zip ./output
chmod <span class="m">777</span> ./output/<span class="nv">$name</span>.zip
rm -r <span class="nv">$name</span>
mv ./output/<span class="nv">$name</span>.zip ./output/<span class="nv">$name</span>
</pre></div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/bash/" rel="tag">bash</a></li>
            <li><a class="tag p-category" href="../../categories/linux/" rel="tag">linux</a></li>
            <li><a class="tag p-category" href="../../categories/python/" rel="tag">python</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../dwm/" rel="prev" title="Hacking DWM : Holdbar">Previous post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2019         <a href="mailto:hsszyman@gmail.com">Hayden Szymanski</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
